In [2]:
import pandas as pd

In [5]:
friend_dict_list = [
    {'name': 'john', 'age': 25, 'job': 'student'},
    {'name': 'nate', 'age': 30, 'job': 'teacher'}
]

In [7]:
df = pd.DataFrame(friend_dict_list)

In [9]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [11]:
from collections import OrderedDict

In [13]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['john', 'nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher']),
    ]
)

In [15]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [18]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [20]:
friend_list = [
    ['john', 25, 'student'],
    ['nate', 30, 'teacher'],
]

In [22]:
column_name = ['name', 'age', 'job']

In [24]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [26]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [28]:
friend_list = [
        ['name', ['john', 'nate']],
        ['age', [25, 30]],
        ['job', ['student', 'teacher']]
]

In [34]:
df = pd.DataFrame.from_dict(dict(friend_list))
# items는 에러 발생 --> 대응책

In [35]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher